# Pandas is a open source library which is built on top of NumPy.
# It allows fast analysis , data cleaning and Preparation.
# Exceles in performance and productivity.
# Has bulit in visualization feature.
# Can work with data from wide variety of sources.

# series

In [1]:
import numpy as np
import pandas as pd

In [2]:
# creating objects
labels =['a','b','c']
my_data= [10,20,30]

In [3]:
# creating array from objects
arr = np.array(my_data)

In [4]:
arr

array([10, 20, 30])

In [5]:
# creating dictionary

d  ={'a':10,'b':20,'c':30}
# "{'key': value,'key': value,'key': value,}

In [6]:
# CREATING SERIES

pd.Series(data = my_data )

0    10
1    20
2    30
dtype: int64

In [7]:
# changing index values

pd.Series(data = my_data , index = labels )

a    10
b    20
c    30
dtype: int64

In [8]:
# passing the dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
# a series can hold any type of data type
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [10]:
# grabbing values from series
ser1 = pd.Series([1,2,3,4],['USA','INDIA','CANADA','RUSSIA'])
# pd.Series([data],[index])

In [11]:
ser1
# here 1,2,3,4 are datapoints while country's names are the indexes

USA       1
INDIA     2
CANADA    3
RUSSIA    4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],['USA','INDIA','ITALY','RUSSIA'])

In [13]:
ser2

USA       1
INDIA     2
ITALY     5
RUSSIA    4
dtype: int64

In [14]:
# grabbing values using indexes
ser1['USA']

1

In [15]:
ser2['INDIA']

2

In [16]:
new = ser1['USA'] + ser2['INDIA']

In [17]:
new

3

In [18]:
ser3 = pd.Series(data = labels)

In [19]:
ser3

0    a
1    b
2    c
dtype: object

In [20]:
ser3[0]

'a'

In [21]:
ser1 + ser2
# note integers are converted into floats in order to retain all the info possible

CANADA    NaN
INDIA     4.0
ITALY     NaN
RUSSIA    8.0
USA       2.0
dtype: float64

# DATAFRAMES
dataframe is a bunch of series.

In [22]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
# grabbing column
df['W']
# here W column itself is a Series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
# grabbing 2 columns at a time
df[['X','W']]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [29]:
# CREATING A NEW COLUMN

df['new'] = df['W'] + df['X']

In [30]:
df['new']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: new, dtype: float64

In [31]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [32]:
# removing column
# df.drop will not make changes in orignal data frame

df.drop('new',axis = 1)

# axis = 0 for rows
# axis = 1 for columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [34]:
# if drop is inplace then it will alter the orignal dataframe
#df.drop('new',axis =1, inplace = True)
# output isgiven below

In [35]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [36]:
df['new'] = df['W'] + df['X']

In [37]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [38]:
# dropping rows
df.drop('E',axis =0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [39]:
df.drop('new',axis =1, inplace =True)

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.shape

(5, 4)

In [42]:
# SELECTING ROWS
# METHOD 1
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [43]:
# METHOD 2
# index based location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [44]:
# selecting SUBSETS of rows and columns

df.loc['C','X']

0.7401220570561068

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [46]:
# CONDITIONAL SELECTION

# getting BOOLEAN OUTPUT

booldf = df>0

In [47]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df[booldf]
# NaN represent False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df['W']>0
# getting a series

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [51]:
# to get only TRUE values

df[df['W']>0]

# helps to remove NaN conditions

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
# to get only False value
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [53]:
df[df['W']>0][['X','Y']]
# getting a series without C column

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [54]:
boolser =df['W']>0
result = df[boolser]

In [55]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
# applying multiple conditions(using AND operation)
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [57]:
# OR operator
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
# changing indexes
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [59]:
# METHOD OF CREATING A NEW LIST

newind = 'CA NY WY OR CO'.split()

In [60]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [61]:
df['States'] = newind

In [62]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [63]:
# creating a new index
# setting states as new index

df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

MULTI-INDEX AND INDEX HEIRARCHY

In [64]:
# INDEX LEVELS
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
outside  # a list

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [66]:
inside

[1, 2, 3, 1, 2, 3]

In [67]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [68]:
# creating a dataframe from scratch
df = pd.DataFrame(randn(6,2),hier_index,['A','B']) 
# 6 rows and 2 columns, index, columns

In [69]:
df
# G1 AND G2 are levels of INDEX 
# 1 2 3 are SUBLEVELS

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [70]:
# addressing using ouside levels
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [71]:
# multi_indexing
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [72]:
df.index.names = ['Groups','Num']
# naming outer levels and inner sublevels

In [73]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [74]:
# grabbing single value
# method 1
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [75]:
#  method 2

df.loc['G2'].loc[2]['B']

0.07295967531703869

In [76]:
# cross-section
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [77]:
# grabbing value at 1 in G1 and G2 using crossection

df.xs(1,level = 'Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

#Dealing with missing data
#Methods for dropping or filling the missing values(NaN)

In [78]:
# create a dataframe or dictionary
d ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],}

#A,B,C are keys
# [1,2,3]... are datasets

In [79]:
df = pd.DataFrame(d)

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
# Pandas will drop any row containing any no. of null value(axis = 0  default for rows)
df.dropna()

     A    B  C
0  1.0  5.0  1

In [82]:
df.dropna(axis =1) # for dropping columns

   C
0  1
1  2
2  3

In [83]:
df.dropna(thresh =2 )

# keeps the row containing atleast 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
# filling in NaN spaces with values
df.fillna(value =1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

 mostly NaN is replaced by mean value of the column

In [86]:
df['A'].fillna(value=df['A'].mean())

# here NaN o value is replaced by the mean value of column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [87]:
df.fillna(value =df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# GROUPBY METHOD
Groupby allows you to group together Rows based off of a Column and perform an aggregate Function on them.

In [88]:
# creating a dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]
       }

In [89]:
df = pd.DataFrame(data)

In [90]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
# grouping together companies
by_comp = df.groupby('Company')

In [92]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [93]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [94]:
by_comp.std()   # standard Deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [95]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [96]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [97]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [98]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [99]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# MERGING , JOINING AND CONCATINATING

#FOR CONCATINATING 
#pd.concat([df1,df2,df3])
#change axis to concatenate using columns

In [100]:
# MERGING allows you to merge datframes togetherusing similar logic as merging SQL tables
#pd.merge(left,right,how='inner',on = 'key')
# left.join(right)

In [101]:
# creating a DataFrame

df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [102]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [103]:
# finding unique values 
# METHOD 1
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [104]:
# defines the no. of unique values in given column
len(df['col2'].unique())

3

In [105]:
# OR
df['col2'].nunique()

3

In [106]:
# defines how many times a value is repeated
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [107]:
# CONDITIONAL SELECTION
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [109]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [110]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [112]:
# APPLIED METHOD
# creating own Function

def times2(x):
    return x*2

In [114]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [116]:
df['col3'].apply(len)
# returns length of each string

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [117]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [119]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [121]:
# Removing columns
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [126]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [127]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [132]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [133]:
# indicates if there is any null value or not
df.isnull()
# False means no null value

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [136]:
# PIVOT TABLE
data ={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [138]:
# this dataset has repeated values

df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [142]:
# CREATING A PIVOT TABLE
df.pivot_table(values ='D', index  = ['A','B'],columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [145]:
# DATA INPUT AND OUTPUT

In [147]:
# Reading a csv file(California Housing Dataset)

housing =pd.read_csv('housing.csv')

In [148]:
housing.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [151]:
#reading from csv files
df.to_csv('my_output',index =False)

In [152]:
pd.read_csv('my_output')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1